# Core Utilities
brew "bash"
brew "bash-completion@2"
brew "coreutils"
brew "findutils"
brew "gnu-sed"
brew "zsh"
brew "git"
brew "gh"
brew "curl"
brew "wget"

# Development Utilities
brew "jq"
brew "fzf"
brew "ripgrep"
brew "bat"
brew "eza"
# brew "lsd"
brew "httpie"
brew "watchman"

# Frontend Development
brew "fnm"
# brew "yarn"
brew "pnpm"

# --- Casks ---

# Fonts
cask "font-hack-nerd-font"

# Terminals
cask "hyper"
# cask "iterm2"
# cask "alacritty"

# Editors / IDEs
cask "visual-studio-code"
cask "cursor"

# Browsers
cask "brave-browser"
cask "google-chrome"

# Productivity & Utilities
cask "raycast"
cask "appcleaner"
cask "docker" # Optional

# Communication
cask "telegram"
cask "whatsapp"
cask "slack"

# Other Apps
cask "chatgpt"

# QuickLook Plugins
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
cask "quicklook-csv"
cask "webpquicklook"
cask "qlprettypatch"
cask "syntax-highlight"
