tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/core"

# packages
brew "bash"
brew "coreutils"
brew "curl"
brew "jpeg", args: ["universal"]
brew "libusb-compat", args: ["universal"]
brew "mas"
brew "node"
brew "wget"
brew "yarn"

# password manager
cask "keepassx"

# browsers
cask "google-chrome"

# editor
cask "visual-studio-code"

# docs
cask "macdown"
mas "Keynote", id: 409183694
mas "Pages", id: 409201541
mas "Numbers", id: 409203825

# mockup
cask "sketch"
cask "sketch-toolbox"

# utilities
cask "appcleaner"
cask "caffeine"
cask "monolingual"
cask "osxfuse"
cask "recordit"
cask "spectacle"
mas "The Unarchiver", id: 425424353

# others
mas "Telegram", id: 747648890
mas "Wunderlist", id: 410628904
cask "spotify"
